backend: tensorflow
class_name: Model
config:
  input_layers:
  - - input_15
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 1024
      dtype: float32
      name: input_15
      sparse: false
    inbound_nodes: []
    name: input_15
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense_70
      trainable: true
      units: 512
      use_bias: true
    inbound_nodes:
    - - - input_15
        - 0
        - 0
        - {}
    name: dense_70
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense_71
      trainable: true
      units: 384
      use_bias: true
    inbound_nodes:
    - - - dense_70
        - 0
        - 0
        - {}
    name: dense_71
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense_72
      trainable: true
      units: 256
      use_bias: true
    inbound_nodes:
    - - - dense_71
        - 0
        - 0
        - {}
    name: dense_72
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense_73
      trainable: true
      units: 128
      use_bias: true
    inbound_nodes:
    - - - dense_72
        - 0
        - 0
        - {}
    name: dense_73
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense_74
      trainable: true
      units: 64
      use_bias: true
    inbound_nodes:
    - - - dense_73
        - 0
        - 0
        - {}
    name: dense_74
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense_75
      trainable: true
      units: 128
      use_bias: true
    inbound_nodes:
    - - - dense_74
        - 0
        - 0
        - {}
    name: dense_75
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense_76
      trainable: true
      units: 256
      use_bias: true
    inbound_nodes:
    - - - dense_75
        - 0
        - 0
        - {}
    name: dense_76
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense_77
      trainable: true
      units: 384
      use_bias: true
    inbound_nodes:
    - - - dense_76
        - 0
        - 0
        - {}
    name: dense_77
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense_78
      trainable: true
      units: 512
      use_bias: true
    inbound_nodes:
    - - - dense_77
        - 0
        - 0
        - {}
    name: dense_78
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense_79
      trainable: true
      units: 1024
      use_bias: true
    inbound_nodes:
    - - - dense_78
        - 0
        - 0
        - {}
    name: dense_79
  name: model_21
  output_layers:
  - - dense_79
    - 0
    - 0
keras_version: 2.2.4-tf
